{
  "_논평":{
    "_version": "0.0.1",
    "_date": "2021-06-09",
    "_contributor": [ "bobyeh @ -github : juntinyeh", "hclo @"],
    "_update_note": [
      "0.0.1- 텍스트 필드를 \\ n에서 문자열 목록 / 배열로 변경합니다.",
      "0.0.0- .en.json에서 번역, OPS 기둥 달성."]
  },
  "OPS 1": {
  "목표":[
    "고객의 비즈니스 목표를 명확하게 이해",
    "이 워크로드가 비즈니스 목표 달성에 직접적인 영향을 미칩니 까?",
    "내부 및 외부 요구 사항에 대한 올바른 정의가 있는지 확인",
    "고객 의사 결정 우선 순위 이해",
    "의사 결정자의 우선 순위 또는 의사 결정 권한이있는 위치 확인"],
  "샘플 질문": [
    "실례합니다. 서비스 및 수요에 대한 결정은 내부적으로 어떻게 결정됩니까?",
    "다른 요구 사이에 충돌이있을 때 우선 순위를 어떻게 (누가) 결정합니까?",
    "이 서비스 (워크로드)가 외부 고객에게 제공하려는 기능 (기능 / 상업적 가치)은 무엇입니까?",
    "외부 고객의 입장에서 주목해야 할 관련 법규가 있나요?",
    "회사 / 팀은이 서비스 (워크로드)의 이점과 위험을 어떻게 판단합니까?"],
  "대상 사람": [
    "비즈니스 또는 관리팀", "R & D 및 유지 보수 팀", "C * O"]
  },
"OPS 2": {
  "목표":[
    "비즈니스 및 팀 인력 구조 확인",
    "작업 흐름 및 전원 관리 / 자원 관리",
    "내부 커뮤니케이션 및 권위에 대한 상호 이해 확인"],
  "샘플 질문": [
    "현재 워크로드 관련 팀에 몇 개의 팀 / 역할 / 부서가 있습니까?",
    "모든 역할은 전임 담당자입니까?",
    "하이브리드 클라우드 환경 또는 AWS와 컴퓨터 실에 정규직이 있습니까?",
    "개발팀 또는 제조업체와의 커뮤니케이션 과정에서 배송 확인 및 기능 테스트를 전문으로하는 사람이 있습니까?"],
  "대상 사람": [
    "비즈니스 또는 관리 팀", "R & D 및 유지 관리 팀"]
},
"OPS 3": {
  "목표":[
    "고객의 기업 문화가 시행 착오를 조장하는지 이해",
    "도구 사용시 고객의 상태 확인"],
  "샘플 질문": [
    "고객이 새로운 Ops 도구를 도입 한 적이 있습니까?",
    "가져 오기 과정에서 어떻게 결정이 내려 지나요?",
    "새로운 기능 / 도구를 가져올 때 적합한 지 여부를 어떻게 결정합니까?",
    "부적합한 도구 또는 서비스 기능, 이점 또는 비즈니스 가치에 도움이되지 않는 경우, 무엇을 수행하거나 해결합니까?"],
  "대상 직원": [ "비즈니스 또는 관리 팀", "R & D 및 유지 관리 팀"]
},
"OPS 4": {
  "목표": [ "다른 수준에서 워크로드의 현재 고객 제어 및 관찰 상태, 다른 수준에서 정보의 가시성 및 숙달 이해", "(애플리케이션 계층,로드, 사용자 활동 및 종속성 의존성은 일반적으로 신뢰도를 나타냅니다. 모든 수준에서 외부에서) ","정보에 대한 고객 제어와 비즈니스 목표 간의 연관성을 이해합니다. "],
  "대상 직원": [ "유지 보수 팀 관리자", "유지 보수 기술자"]
},
"OPS 5":
{
"목표": [ "고객 내 변경 관리 / 요구 사항 관리에 대한 세부 정보 이해",
  "일단 변경이 필요하면 비즈니스 의사 결정 또는 다양한 수준의 의사 결정 관리와 관련이 있습니다.",
  "관리 모델이 고객 서비스를위한 시장 출시 시간 (TTM-Time To Market)을 단축하는 데 도움이됩니까?"],
"관련 문제": [ "OPS 1", "OPS 2"],
"대상 직원": [ "유지 보수 팀 관리자", "유지 보수 기술자"]
},
"OPS 6": {
  "목표": [ "고객의 배포 프로세스 및 관련 세부 정보 이해",
    "다양한 단계의 작업 환경 및 배포 연습",
    "배포 실패 및 관련 프로세스에 대한 테스트 및 준비"],
  "대상 직원": [ "유지 보수 팀 관리자", "유지 보수 기술자"]
},
"OPS 7": {
  "목표": [ "고객 유지 보수 팀의 현재 상태 이해",
    "유지 보수 관련 기술 / 도구, 작업 흐름의 정규직 / 파트 타임 유지 보수 직원",
    "모든 채널의 원활한 흐름을 보장하기위한 정보 통제 및 의사 결정의 상태"],
  "대상 직원": [ "유지 보수 팀 관리자", "유지 보수 기술자"]
},
"OPS 8": {
  "목표":[
    "다른 수준, 상업 / 기술 팀에서 현재 고객 유지 관리 KPI 설정 이해",
    "비즈니스 팀과 기술 팀이 설정 한 KPI간에 양의 상관 관계가 있습니까?",
    "참조 벤치 마크, 추세 분석 또는 비정상 참조를 설정하는 데 사용되는 분석을위한 올바른 데이터 수집이 있습니까?",
    "비즈니스 결정에 이러한 유지 관리 데이터에 대한 참조가 있습니까?"],
  "샘플 질문": [
    "유지 보수 팀은 업계의 상태에 해당하는 관찰 지표를 가지고 있습니까?",
    "비즈니스 팀이 추세 분석이나 예측을 할 수있는 데이터 분석이 있습니까?"],
  "관련 문제": [ "OPS9", "REL6"],
  "대상 직원": [ "비즈니스 또는 관리 팀", "유지 관리 팀"]
},
"OPS 9": {
  "목표":[
    "유지 관리 팀 / 개발 팀에 대한 관련 KPI 설정이 있는지 여부 및 고객 출력과의 상관 관계 (예 : 새 기능이 시작된 후 추가 된 고객 서비스 사례 수)"
    , "참조 벤치 마크, 추세 분석 또는 비정상 참조 설정을위한 올바른 데이터 분석이 있습니까?", "비즈니스 결정에 이러한 유지 관리 데이터에 대한 참조가 있습니까?"],
  "샘플 질문": [
    "현재 생산 환경에있는 모니터링 항목은 무엇입니까?",
    "KPI는 무엇입니까?",
    "이들 중 주요 비즈니스 팀 또는 비즈니스 수치와 관련된 것은 무엇입니까?",
    "(제조) 공장 생산 라인의 모니터링 KPI가 출하 속도 지표와 일치합니까?"],
  "관련 문제": [ "OPS 8", "REL6"],
  "대상 직원": [ "비즈니스 또는 관리 팀", "R & D 유지 관리 팀"]
},
"OPS 10": {
  "목표": [ "사고 처리에 대한 현재 고객의 유지 보수 팀의 접근 방식 이해"],
  "샘플 질문": [
    "과거에 유지 보수 사고가 있었나요?",
    "환경 유지 보수 사고에 대한 표준 운영 절차는 무엇입니까?",
    "작업 프로세스에 대한 문서 참조가 있습니까? On Call 또는 Page와 같은 활성 알림 메커니즘이 있습니까?",
    "대시 보드의 다른 수준이 있습니까?",
    "자동화 스크립트가 있습니까?"],
  "관련 문제": [ "OPS 7"],
  "대상 직원": [ "유지 보수 팀 관리자", "유지 보수 기술자"]
},
"OPS 11": {
  "목표": [ "유지 보수 팀에서 사용하는 현재 관리 메커니즘이 비즈니스 상태를 지속적으로 개선 할 수 있는지 확인"],
  "샘플 질문": [ "과거에 유지 보수 사고가 있었습니까? 비즈니스 목표에 도움이 될 수있는 후속 개선 메커니즘이 있습니까?"],
  "대상 직원": [ "상업 팀 관리자", "비즈니스 팀 관리자", "프로젝트 관리자", "유지 관리 팀 관리자", "유지 관리 기술 직원"]
},
"SEC 1": {
  "목표": [ "현재 고객의 실제 보안 실행 및 구현 상태 이해",
    "운영 및 유지 보수의 우수성 기둥의 정의에 따라 개선 및 안전한 운영으로 확장 할 수있는 기준이 있는지 확인",
    "고객이 모든 안전 작업이 최신 상태이고 업계 요구 사항 및 규제 인증을 준수하는지 확인하는 방법 확인",
    "고객이 보안 위협을 인식하고 직면하는 방식 이해",
  "고객이 자동화 된 프로세스를 사용하여 안전 관련 작업을 개선, 테스트 및 확인하는 방법 확인"],
  "샘플 질문": [ "현재 R & D 및 유지 관리 팀은 AWS 계정을 어떻게 운영합니까? 하이브리드 클라우드 또는 지상 컴퓨터 실?",
    "실례합니다. 이러한 중요한 환경 계정은 어떻게 보호됩니까? 간단한 계정 암호 또는 다단계 MFA 인증?",
    "현재 기술 팀은 모든 환경 보안에 정보 보안 허점이 있는지 어떻게 확인할 수 있습니까?",
    "CVE와 같은 정보 보안과 관련된 정보에주의를 기울이는 전담 채널이나 상근 직원이 있습니까?",
    "실례합니다. 과거에 환경 안전 검사를 얼마나 자주 했습니까?"],
  "대상 직원": [ "기술 R & D 팀", "유지 보수 팀"]
},
"SEC 2": {
  "목표": [ "회사 조직의 내부 또는 외부에 관계없이 현재 고객의 개인 신원 관리 이해",
    "소프트웨어 응용 프로그램을 실행하는 동안 고객이 요구하는 현재 ID 관리 이해"],
  "예제 질문": [ "현재 R & D 팀에서 AWS 환경을 운영하는 데 몇 명의 동료가 필요합니까?",
    "R & D 동료의 AWS 계정은 어떻게 관리됩니까? 별도로 배포합니까 아니면 계정 암호를 공유합니까?",
    "계정 관리에서 다단계 인증 MFA를 사용합니까?",
    "계정 권한에 차이가 있습니까? 모든 동료가 관리자 권한을 직접 배포합니까?",
    "AWS 환경의 EC2 가상 인스턴스에서 계정을 관리하는 방법? .PEM 파일을 관리하는 방법?",
    "RDS의 계정과 비밀번호는 어떻게 관리됩니까? 애플리케이션이 데이터베이스에 어떻게 연결됩니까?",
    "프로그램이 S3에 대해 미리 서명 된 URL을 만들어야하는 경우 API를 어떻게 호출합니까? API_Key / Secret_Key를 어디에 저장합니까?",
    "Lambda 작업에서 IAM 역할을 설정하는 방법? 역할의 권한은 무엇입니까?",
    "실례합니다. 이러한 정적 자격 증명이 마지막으로 교체 된 것이 언제입니까?"],
  "대상 직원": [ "기술 R & D 팀", "유지 보수 팀"]
},
"SEC 3": {
  "예제 질문": [ "R & D 또는 유지 보수 팀이 서로 다른 환경에서 서로 다른 권한을 가지고 있습니까?",
    "테스트 환경에서 모든 동료는 모든 AWS 서비스 리소스를 열 수있는 권한이 있습니까?",
    "자원 제한이나 면적이 있습니까?",
    "유지 보수 팀의 공식 환경 (Prod)에서 각 개인의 권한 설정을 구별하는 방법은 무엇입니까?",
    "R & D 구성원이 유지 보수 과정에서 공식 환경의 설정을 긴급하게 운영하거나 수정해야하는 경우 관련 담당자에게 권한 또는 계정을 어떻게 발급 할 수 있습니까?",
    "프로젝트가 종료되거나 직원이 퇴사 한 후 이미 개설 된 AWS 계정 및 기타 시스템 계정을 제어하는 ​​해당 프로세스가 있습니까?",
    "다른 AWS 계정 간의 리소스 공유 또는 IAM 역할 가정은 현재 어떻게 기록되고 추적됩니까?"],
  "대상 직원": [ "기술 R & D 팀", "유지 보수 팀"]
},
"SEC 4": {
    "샘플 질문": [ "현재 인프라 계층에서 수집 된 관련 로그 레코드 (로그)가 있습니까?",
      "애플리케이션 (AP) 계층에서 수집 된 비정상적인 액세스와 같은 관련 로그 기록이 있는지 물어봐도 될까요?",
      "현재 Linux Server의 Port 22가 완전히 개방되어 있습니다. secure.log를 정기적으로 확인하십니까?",
      "현재 이러한 로그 기록은 기본 위치에 있습니까 아니면 중앙에 저장됩니까?",
      "이러한 보안 로그 레코드에 대한 분석 또는 경고 (경고)가 있습니까?",
      "동일한 IP 네트워크 세그먼트에서 지속적으로 비정상적인 액세스를하는 경우 수동으로 처리합니까 아니면 자동으로 차단됩니까?",
      "개선 할 방법이 있다는 것을 이미 알고 있다면 지금 어떻게 처리합니까?"],
    "대상 직원": [ "기술 R & D 팀", "유지 보수 팀"]
},
"SEC 5": {
  "Sample Question": [ "현재 계정의 VPC는 ​​어떻게 설정되어 있습니까?",
      "다른 계정 이전에 VPC 피어링의 전략은 무엇입니까?",
      "현재 Public Subnet / Private Subnet 간의 설정 및 구분은 어떻게됩니까?",
      "VPC 내부에서 EC2에 어떻게 연결하고 액세스합니까?",
      "Bastion을 연결하여 정식 환경의 RDS에 액세스하는 방법은 무엇입니까?",
      "스프링 보드는 공용 네트워크와 보안 그룹을 통해 액세스를 제한하는 데 사용되지만 소스 IP 네트워크 세그먼트를 공유하는 사람은 몇 명입니까?",
      "모든 작업의 ​​안전성을 확인하기 위해 VPC 흐름 로그를 어떻게 사용합니까?"],
    "대상 직원": [ "기술 R & D 팀", "유지 보수 팀"]
},
"SEC 6": {
  "샘플 질문": [ "애플리케이션 (AP) 계층에 유용한 외부 라이브러리 (lib)가 있습니까?",
      "어떤 상황에서 현재 사용중인 라이브러리에 보안 문제가있을 수 있음을 알 수 있습니까?",
      "아웃소싱 공급 업체가 바이너리 또는 소스 코드를 제공합니까?",
      "애플리케이션 계층에 보안 취약점이 없는지 어떻게 확인할 수 있습니까?",
      "현재 ECS에서 사용되는 기본 이미지는 외부에서 가져온 것입니다. 확인 또는 스캔이 수행 되었습니까?",
      "이 Windows 서버는 현재 보안 패치를 어떻게 수행합니까?",
      "Ops 팀은 Ansible을 사용하여 Linux 서버를 일괄 적으로 운영합니다. 모든 운영의 보안을 어떻게 결정합니까?",
      "온라인 결제 관련 기능의 취약점이 검색 되었습니까?"],
    "대상 직원": [ "기술 R & D 팀", "유지 보수 팀"]
},
"SEC 7": {
  "Sample Question": [ "현재 모든 데이터는 동일한 데이터베이스에 저장되거나 별도로 보관됩니다.",
    "환자 관련 PII는 어떻게 저장됩니까?",
    "사용자 식별 데이터는 현재 어떻게 저장되고 보호됩니까? 데이터베이스에 일반 텍스트로 저장됩니까?",
    "현재 회원 사용자 관련 사진, 텍스트, 데이터는 어떻게 저장 되나요?",
    "매우 민감한 데이터가있는 경우 현재 저장 기간 및 제한 시간은 어떻게 설정되어 있습니까?"],
    "대상 직원": [ "기술 R & D 팀", "유지 관리 팀"]},
"SEC 8": {
  "Target": [ "중장기 스토리지에 저장된 데이터를 보호하는 방법을 이해합니다. 이것은 S3 또는 데이터베이스 인스턴스에있을 수 있습니다.", "Un의 위험을 줄이기 위해 여러 제어를 구현하는 방법 -승인 된 액세스 및 잘못된 취급. "]},
"SEC 9": {
  "Target": [ "전송 중에 데이터를 보호하는 방법에 대한 이해를 얻습니다. 이것은 네트워크를 통해 전송되거나 게이트웨이 / 메시징과 같은 통신 서비스를 통해 전송되는 데이터 일 수 있습니다.", "감소를 위해 여러 제어를 구현하는 방법 무단 액세스 및 잘못된 취급의 위험이 있습니다. "]},
"SEC 10": {
  "Target": [ "보안 사고에 대비하여 구현하는 사항이 무엇인지 이해합니다.", "어떻게하면 적시에 효과적인 조사를 실행하고 이벤트 / 사고에 대한 대응 및 복구를 수행 할 수 있습니까? 조직의 중단을 최소화합니다. "]},
"REL 1": {
  "Target": [ "서비스 견적의 개념에 대한 인식과 그 개념이 우발적 인 프로비저닝으로부터 보호하기 위해 존재하는 이유를 이해합니다.", "이 문제를 해결하기 위해 현재 워크로드를 관리하는 방법도 이해합니다."] },
"REL 2": {
  "Target": [ "네트워크 토폴로지 계획 및 구현에 대한 접근 방식을 이해합니다.", "시스템 내 및 시스템 간 연결, 공용 IP를 포함하는 네트워크 토폴로지를 계획 할 때 고려하는 사항은 무엇입니까? 주소 관리, 개인 IP 주소 관리, 도메인 이름 확인. "]},
"REL 3": {
  "Target": [ "Service-oritented Architecture를 구현하는 방법에 대한 이해를 얻었습니까?", "워크로드를 분할하는 방법 및 각 서비스가 특정 기능 또는 비즈니스 도메인에 초점을 맞추고 있는지 여부.", " 워크로드는 현재 단일 또는 다중 모놀리스로 실행됩니까? 아니면 애플리케이션을 Mircoservice 모델로 실행하고 있습니까? "]},
"REL 4": {
  "Target": [ "분산 시스템의 일부 또는이 워크로드와 상호 작용 / 의존하는 다른 시스템 간의 상호 작용을 설계하는 방법을 이해합니다.", "시스템에 중단 / 실패가 발생하면 워크로드가 상호 작용하거나 그 반대의 경우도 마찬가지입니다. , 워크로드와 다른 연결 시스템에 미치는 영향은 무엇입니까? ","그들은 어떻게 처리하고 있습니까? "]},
"REL 5": {
  "Target": [ "장애를 관리하기 위해 분산 시스템에서 상호 작용을 설계 할 때 구현 한 것들 / 접근법이 무엇인지 이해하거나 시스템이이를 이해할 수 있도록합니다."]},
"REL 6": {
  "Target": [ "워크로드 리소스를 모니터링하는 방법을 이해하고 있습니까?", "모니터링중인 워크로드에서 어떤 사항이 있으며 워크로드의 안정성을 높이기 위해 이러한 데이터를 어떻게 처리하고 있습니까?"],
  "관련 문제": [ "OPS 8", "OPS 9", "REL 6"]},
"REL 7": {
  "Target": [ "워크로드가 수요 변화에 적응할 수 있도록 워크로드에 대한 설계 접근 방식을 이해합니다.", "이 적응 능력을 구현하는 방법에 대해 알아보십시오. 자세한 기술 정보를 수집하십시오. 그들의 접근 방식 "],
  "관련 문제": "비용 9"},
"REL 8": {
  "Target": [ "애플리케이션 및 인프라 수준에서 워크로드의 변경을 구현하는 프로세스에 대한 이해를 얻습니다.", "패치 / 소프트웨어 / 구성 변경과 같은 변경 사항을 안정적으로 구현하기 위해 수행하는 작업은 무엇입니까? 통제 된 방식으로 수행되고 있는가? ","통제 된 방식으로 변경이 수행되지 않으면 이러한 변경의 효과를 예측하고 적절한 후속 질문을 결정하는 것이 어려울 수 있습니다. "]},
"REL 9": {
  "Target": [ "데이터를 백업하는 방법에 대한 이해를 얻었습니다.", "RTO / RPO에 대해 정의하고 비즈니스에 동의 했습니까?", "비즈니스의 지시가없는 경우 무엇인지 알고 있습니까? 현재 구현 한 전략에서 RTO / RPO? "],
  "관련 문제": "REL 13"},
"REL 10": {
  "대상": [ "다른 서비스에 대한 영향을 관리 / 감소시키기 위해 워크로드에서 장애가 발생했을 때 영향을 격리하는 방법 / 전략에 대한 이해를 얻습니다.", "이것은 워크로드가 여러 구성 요소에 분산되어있는 경우 특히 두드러집니다. ","워크로드가 모놀리스 인 경우 워크로드와 상호 연결되는 주변 서비스 (예 : 청구 시스템, crm 등)를 살펴보십시오. 서비스에 의존하는 다른 서비스에 미치는 영향을 줄이기 위해 어떤 전략을 구현하고 있습니까? "]} ,
"REL 11": {
  "Target": [ "시스템에서 문제가 발생할 경우 평균 복구 시간을 낮추기위한 전략 / 접근법이 무엇인지 이해합니다.", "현재 평균 복구 시간은 얼마입니까?", "접근법은 무엇입니까? / 프로세스 / 구현에서 이러한 평균 복구 시간 단축을 처리해야합니다 (문제가보고 된 후 해결 될 때까지 걸리는 평균 시간) "]},
"REL 12": {
  "Target": "워크로드에 대한 안정성을 향상시키기 위해 필요한 모든 전략을 어떻게 테스트하고 있는지 이해합니다."},
"REL 13": {
  "Target": [ "재해 복구 계획에 대한 이해 확보", "이 계획을 문서화하고 테스트 했습니까?", "RTO / RPO를 정의 했습니까?"],
  "관련 문제": "REL 9"},
"PERF 1": {
  "Target": [ "워크로드에 가장 적합한 아키텍처 모델을 갖출 수 있도록 접근 방식에 대한 이해 / 통찰을 얻습니다."]},
"PERF 2": {
  "Target": "워크로드에 적합한 컴퓨팅 솔루션을 선택하기 위해 취한 전략 / 접근법이 무엇인지 이해합니다."},
"PERF 3": {
  "목표": "워크로드에 적합한 스토리지 솔루션을 선택하기 위해 취한 전략 / 접근법이 무엇인지 이해합니다."},
"PERF 4": {
  "목표": "워크로드에 적합한 데이터베이스 솔루션을 선택하기 위해 취한 전략 / 접근법이 무엇인지 이해합니다."},
"PERF 5": {
  "Target": "요구 사항과 제약 사항에 따라 최적의 네트워크 구성을 갖출 수 있도록 전략 / 접근 방식이 무엇인지 이해합니다."},
"PERF 6": {
  "Target": [ "새로운 리소스 및 서비스를 최신 상태로 유지하기위한 접근 방식을 이해합니다.", "워크로드 성능을 개선하기 위해 정의 할 프로세스가 있습니까?", "워크로드를 지속적으로 보장하기 위해 어떤 메커니즘을 사용합니까? 개선을 향해 진화합니까? "]},
"PERF 7": {
  "Target": [ "모니터링하는 모든 리소스의 성능 메트릭을 기록하고, 벤치 마크를 설정하고, 성능 저하 표시시 조치를 취하기위한 적절한 경고를 설정하기위한 접근 방식에 대한 이해"]},
"PERF 8": {
  "Target": [ "성능 관점에서 중요하다고 생각하는 워크로드 영역에 대한 고객의 이해에 대한 통찰력을 얻습니다.", "이를 달성하기 위해 어떤 측면을 절충 할 수 있는지, 그리고 고객에게 미치는 영향과 효율성을 결정합니다. ","어떻게 이러한 영향을 추적 / 측정하고 있습니다. ","이러한 트레이드 오프를 완화하기 위해 어떤 전략을 사용합니까? "]},
"비용 1": {
  "Target": [ "클라우드 지출 관리와 관련하여 고객이 어떤 관행을 가지고 있는지 이해합니다.", "관리를 처리하기위한 전담 기능을 설정 했습니까?", "일반적인 전략은 무엇이며 Cloud Financial Management를 처리하기 위해 구현하는 것입니다. "]},
"비용 2": {
  "Goals": [ "워크로드 사용을 관리하기 위해 워크로드에서 구현하는 것이 무엇인지에 대한 통찰력을 얻습니다.", "목표를 계속 달성하면서 비용을 적절히 발생시키기 위해 구현 된 전략 및 항목은 무엇입니까? "],
  "관련 문제": "SEC 3"},
"비용 3": {
  "목표": "사용 된 리소스의 사용량을 모니터링하기 위해 구현 된 사항과 특정 범주에 대한 비용의 반감을 만드는 데 사용하는 메커니즘에 대한 통찰력을 얻습니다.",
  "관련 문제": "OPS 8, REL 1, REL 6"},
"비용 4": {
  "목표": "폐기물을 줄이기 위해 자원을 해체 할 때 그들의 접근 방식은 무엇입니까?",
  "관련 문제": "REL 6"},
"비용 5": {
  "Target": [ "워크로드의 구성 요소로 서비스를 선택할 때 비용을 평가하기위한 접근 방식 및 전략에 대한 통찰력을 얻습니다."]},
"비용 6": {
  "목표": "낭비를 최소화하면서 당면한 작업을 수용 할 수 있도록 자원 크기와 수량을 선택할 때 그들의 노력에 대한 통찰력을 얻습니다.",
  "관련 문제": "PERF 2, PERF 3, PERF 4"},
"비용 7": {
  "Target": [ "AWS 클라우드 비용 모델에 대한 이해와 워크로드에 적합한 가격 모델을 활용하고 있는지에 대한 통찰력을 얻습니다.", "부담 했습니까, 예약 인스턴스 가격 책정?, 계획 절약?"],
  "관련 문제": "OPS 1, OPS 4"},
"비용 8": {
  "Target": [ "워크로드의 데이터 전송 요금에 대한 이해와이를 관리 / 준비하기 위해 어떤 전략을 구현 했습니까?"],
  "관련 문제": "REL 2, PERF 5"},
"비용 9": {
  "목표": "자원의 수요와 공급을 관리 할 수있는 접근 방식이 무엇인지 이해합니다. 낭비를 최소화하면서.",
  "관련 문제": "REL 6"},
"비용 10": {
  "Target": [ "워크로드 비용 최적화를 개선 할 기능인 AWS의 새로운 서비스를 따라 잡기위한 프로세스 / 접근 방식을 이해합니다."]}
}